MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_07_20_04/NMEA.cpp
/*
  Модуль NMEA.cpp
  Назначение:
  - Формирование и отправка текстовых выходных сообщений о полетных данных.

  Основные задачи модуля:
  - Генерировать NMEA-строки нашего самолета и сторонних целей.
  - Формировать контейнерный текстовый вывод для Serial/RS485/UDP/Bluetooth.
  - Соблюдать выбранные в WEB-интерфейсе режимы вывода.
  - Сопровождать вывод диагностикой и объявлением активного режима Serial.
*/

#include "NMEA.h"
#include "TrafficDB.h"
#include "DeviceInfo.h"
#include "EEPROMRF.h"
#include "RS485Display.h"
#include "Bluetooth.h"
#include "GNSS.h"
#include "Baro.h"
#include "RF.h"
#include "LANRF.h"
#include "WiFiRF.h"
#include <TimeLib.h>
#include <stdio.h>
#include <math.h>
#include <string.h>

#ifndef DEG_TO_RAD
#define DEG_TO_RAD 0.017453292519943295769236907684886f
#endif

static bool g_rs485Ready = false;
static NMEADiag g_diag = {};
static uint8_t g_lastAnnouncedSerialMode = 0xFFU;
static uint32_t g_lastPgrmzMs = 0;

static const char* serialModeHeaderName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RP2040: return "RP2040 RX";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_LORA_RAW: return "LoRa RAW RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        case OUTPUT_MODE_ADSB_ESP32: return "ADSB ESP32S3 RX";
        default: return "Off";
    }
}

void NMEA_announceSerialModeIfNeeded()
{
    const uint8_t mode = (settings != nullptr) ? settings->serial_out : OUTPUT_MODE_OFF;
    if (mode == g_lastAnnouncedSerialMode)
    {
        return;
    }

    g_lastAnnouncedSerialMode = mode;
    if (mode == OUTPUT_MODE_MAVLINK)
    {
        return;
    }

    Serial.print("=== SERIAL MODE: ");
    Serial.print(serialModeHeaderName(mode));
    Serial.print(" ===\r\n");
    vTaskDelay(pdMS_TO_TICKS(4));
}

static uint8_t nmeaChecksum(const char* sentenceWithoutChecksum)
{
    uint8_t cs = 0;
    if (sentenceWithoutChecksum == nullptr) return 0;
    while (*sentenceWithoutChecksum)
    {
        cs ^= (uint8_t)*sentenceWithoutChecksum++;
    }
    return cs;
}

static size_t wrapNMEALine(const char* body, char* out, size_t outSize)
{
    if (body == nullptr || out == nullptr || outSize < 8)
    {
        return 0;
    }

    const uint8_t cs = nmeaChecksum(body);
    const int written = snprintf(out, outSize, "$%s*%02X\r\n", body, cs);
    if (written <= 0 || (size_t)written >= outSize)
    {
        return 0;
    }
    return (size_t)written;
}

static void rs485Write(const char* data, size_t len)
{
    if (!g_rs485Ready || data == nullptr || len == 0)
    {
        return;
    }

#if SOC_GPIO_PIN_RS485_DE >= 0
    digitalWrite(SOC_GPIO_PIN_RS485_DE, HIGH);
    delayMicroseconds(100);
#endif
    RS485_SERIAL.write((const uint8_t*)data, len);
    RS485_SERIAL.flush();
#if SOC_GPIO_PIN_RS485_DE >= 0
    delayMicroseconds(100);
    digitalWrite(SOC_GPIO_PIN_RS485_DE, LOW);
#endif
}

static bool sendNmeaToConfiguredOutput(const char* line, size_t len)
{
    if (settings == nullptr || line == nullptr || len == 0)
    {
        return false;
    }

    g_diag.nmeaOutput = settings->nmea_out;
    g_diag.udpPort = (settings->udp_port != 0U) ? settings->udp_port : (uint16_t)NMEA_UDP_PORT;
    g_diag.bluetoothMode = settings->bluetooth;

    bool sent = false;
    switch (settings->nmea_out)
    {
        case NMEA_OUTPUT_SERIAL:
            Serial.write((const uint8_t*)line, len);
            ++g_diag.sentencesSerial;
            sent = true;
            break;
        case NMEA_OUTPUT_UDP:
        {
            bool udpSent = false;
            if (LAN_udpWorking())
            {
                LAN_sendUDP((const uint8_t*)line, len);
                udpSent = true;
            }
            if (WiFi_transmitUDP(g_diag.udpPort, (const uint8_t*)line, len))
            {
                udpSent = true;
            }
            if (udpSent)
            {
                ++g_diag.sentencesUDP;
                sent = true;
            }
            break;
        }
        case NMEA_OUTPUT_BLUETOOTH:
            {
                const size_t written = Bluetooth_write((const uint8_t*)line, len);
                if (written > 0)
                {
                    ++g_diag.sentencesBluetooth;
                    sent = true;
                }
            }
            break;
        case NMEA_OUTPUT_OFF:
        default:
            break;
    }

    if (settings->serial_out == OUTPUT_MODE_NMEA && settings->nmea_out != NMEA_OUTPUT_SERIAL)
    {
        Serial.write((const uint8_t*)line, len);
        ++g_diag.sentencesSerial;
        sent = true;
    }

    if (settings->rs485_out == OUTPUT_MODE_NMEA)
    {
        rs485Write(line, len);
        ++g_diag.sentencesRS485;
        sent = true;
    }

    return sent;
}

static void sendContainerToConfiguredOutputs(const char* line, size_t len)
{
    if (settings == nullptr || line == nullptr || len == 0)
    {
        return;
    }

    g_diag.serialMode = settings->serial_out;
    g_diag.rs485Mode = settings->rs485_out;

    // Для Serial в режиме OUTPUT_MODE_CONTAINER используется штатный дамп
    // ThisAircraft / Container[i] ниже в NMEA_loop().
    // Здесь оставляем вывод контейнера только для RS485, чтобы при выборе
    // "Вывод данных в Serial = Container" в Serial не появлялся второй,
    // лишний формат строк вида ICAO=... .
    if (settings->rs485_out != OUTPUT_MODE_RS485_DISPLAY && settings->rs485_out == OUTPUT_MODE_CONTAINER)
    {
        rs485Write(line, len);
        ++g_diag.sentencesRS485;
    }
}

static bool aircraftHasCoordinates(const Aircraft& ac)
{
    return fabsf(ac.lat) > 0.00001f || fabsf(ac.lon) > 0.00001f;
}

static void sanitizeCallsign(const char* src, char* dst, size_t dstSize)
{
    if (dst == nullptr || dstSize == 0) return;
    memset(dst, 0, dstSize);
    if (src == nullptr) return;

