MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_07_20_04/NMEA.cpp
    size_t outIdx = 0;
    for (size_t i = 0; src[i] != '\0' && outIdx < (dstSize - 1); ++i)
    {
        const char c = src[i];
        if (c == ' ' || c == ',' || c == '*') break;
        dst[outIdx++] = c;
    }
    dst[outIdx] = 0;
}

static void makeFallbackCallsign(const Aircraft& ac, char* dst, size_t dstSize)
{
    if (dst == nullptr || dstSize == 0) return;
    const char* prefix = "T";
    switch (ac.protocol)
    {
        case RF_PROTOCOL_LEGACY:    prefix = "FLR"; break;
        case RF_PROTOCOL_OGNTP:     prefix = "OGN"; break;
        case RF_PROTOCOL_P3I:       prefix = "PAW"; break;
        case RF_PROTOCOL_ADSB_1090: prefix = "ADS"; break;
        case RF_PROTOCOL_ADSB_UAT:  prefix = "UAT"; break;
        case RF_PROTOCOL_FANET:     prefix = "FAN"; break;
        case RF_PROTOCOL_APRS:      prefix = "HAM"; break;
        default:                    break;
    }
    snprintf(dst, dstSize, "%s_%06lX", prefix, (unsigned long)(ac.addr & 0xFFFFFFUL));
}

static bool getOwnshipPosition(float& lat, float& lon)
{
    lat = ThisAircraft.latitude;
    lon = ThisAircraft.longitude;

    if (fabsf(lat) <= 0.00001f && fabsf(lon) <= 0.00001f)
    {
        lat = ThisAircraft.local_latitude;
        lon = ThisAircraft.local_longitude;
    }
    if (fabsf(lat) <= 0.00001f && fabsf(lon) <= 0.00001f && GNSS_coordinatesValid())
    {
        lat = GNSS_latitude();
        lon = GNSS_longitude();
    }

    return fabsf(lat) > 0.00001f || fabsf(lon) > 0.00001f;
}

static bool outputTimeValid()
{
    return GNSS_timeValid() ||
           (settings != nullptr && FlyRfMode_usesLocalCoordinates(settings->mode));
}

static uint8_t outputCentisecond()
{
    return GNSS_timeValid() ? GNSS_timeCentisecond() : 0U;
}

static bool buildDateTimeFields(char* utcTime, size_t utcTimeSize, char* utcDate, size_t utcDateSize)
{
    if (!outputTimeValid() || utcTime == nullptr || utcDate == nullptr || utcTimeSize < 7 || utcDateSize < 7)
    {
        return false;
    }

    const time_t t = now();
    snprintf(utcTime, utcTimeSize, "%02d%02d%02d", hour(t), minute(t), second(t));
    snprintf(utcDate, utcDateSize, "%02d%02d%02d", day(t), month(t), year(t) % 100);
    return true;
}

// - utcTime: Временная отметка, интервал или значение тайм-аута.
// - body: Параметр геометрии, координаты, размера или угла.
static void sendOwnshipRMC()
{
    if (settings == nullptr) return;
    float lat = 0.0f;
    float lon = 0.0f;
    if (!getOwnshipPosition(lat, lon) || !outputTimeValid()) return;
    const char latHem = (lat >= 0.0f) ? 'N' : 'S';
    const char lonHem = (lon >= 0.0f) ? 'E' : 'W';
    const float absLat = fabsf(lat);
    const float absLon = fabsf(lon);
    const int latDeg = (int)absLat;
    const int lonDeg = (int)absLon;
    const float latMin = (absLat - (float)latDeg) * 60.0f;
    const float lonMin = (absLon - (float)lonDeg) * 60.0f;

    char utcTime[16] = {};
    char utcDate[16] = {};
    if (!buildDateTimeFields(utcTime, sizeof(utcTime), utcDate, sizeof(utcDate))) return;

    char body[160];
    char sentence[180];
    snprintf(body, sizeof(body),
             "GPRMC,%s.%02u,A,%02d%07.4f,%c,%03d%07.4f,%c,%.1f,%.1f,%s,,,P",
             utcTime,
             (unsigned)outputCentisecond(),
             latDeg, latMin, latHem,
             lonDeg, lonMin, lonHem,
             ThisAircraft.speed,
             ThisAircraft.course,
             utcDate);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

// - utcTime: Временная отметка, интервал или значение тайм-аута.
// - body: Параметр геометрии, координаты, размера или угла.
static void sendOwnshipGGA()
{
    if (settings == nullptr) return;
    float lat = 0.0f;
    float lon = 0.0f;
    if (!getOwnshipPosition(lat, lon) || !outputTimeValid()) return;
    const char latHem = (lat >= 0.0f) ? 'N' : 'S';
    const char lonHem = (lon >= 0.0f) ? 'E' : 'W';
    const float absLat = fabsf(lat);
    const float absLon = fabsf(lon);
    const int latDeg = (int)absLat;
    const int lonDeg = (int)absLon;
    const float latMin = (absLat - (float)latDeg) * 60.0f;
    const float lonMin = (absLon - (float)lonDeg) * 60.0f;
    char utcTime[16] = {};
    char utcDate[16] = {};
    if (!buildDateTimeFields(utcTime, sizeof(utcTime), utcDate, sizeof(utcDate))) return;
    (void)utcDate;

    char body[160];
    char sentence[180];
    const float hdop = (ThisAircraft.hdop > 0U) ? ((float)ThisAircraft.hdop / 100.0f) : 2.3f;
    snprintf(body, sizeof(body),
             "GPGGA,%s.%02u,%02d%07.4f,%c,%03d%07.4f,%c,3,,%.1f,%.1f,M,%.1f,M,,",
             utcTime,
             (unsigned)outputCentisecond(),
             latDeg, latMin, latHem,
             lonDeg, lonMin, lonHem,
             (double)hdop,
             (double)ThisAircraft.altitude,
             (double)ThisAircraft.geoid_separation);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

static void sendOwnshipGSA()
{
    float lat = 0.0f;
    float lon = 0.0f;
    if (settings == nullptr || !getOwnshipPosition(lat, lon)) return;

    const float hdop = (ThisAircraft.hdop > 0U) ? ((float)ThisAircraft.hdop / 100.0f) : 2.3f;
    const float vdop = 1.2f;
    const float pdop = sqrtf(hdop * hdop + vdop * vdop);
    char body[96];
    char sentence[112];
    snprintf(body, sizeof(body), "GPGSA,A,3,,,,,,,,,,,,,%.1f,%.1f,%.1f",
             (double)pdop, (double)hdop, (double)vdop);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

// - body: Параметр геометрии, координаты, размера или угла.
static void sendOwnshipPGRMZ()
{
    if (settings == nullptr) return;
    if ((uint32_t)(millis() - g_lastPgrmzMs) < 1000UL) return;

    const int altitudeFt = constrain((int)lroundf(ThisAircraft.pressure_altitude * 3.28084f), -1000, 60000);
    char body[64];
    char sentence[80];
    snprintf(body, sizeof(body), "PGRMZ,%d,f,%c", altitudeFt,
             GNSS_coordinatesValid() ? '3' : '1');
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    if (len > 0)
    {
        sendNmeaToConfiguredOutput(sentence, len);
        g_lastPgrmzMs = millis();
    }
}

static void sendOwnshipLK8EX1()
{
    const int altitudeMeters =
        constrain((int)lroundf(ThisAircraft.pressure_altitude), -1000, 99998);
    const int verticalSpeedCms =
        (int)lroundf((float)ThisAircraft.vert_rate * 0.508f);
    const int temperatureC =
        constrain((int)lroundf(Baro_available() ? Baro_temperatureC() : 0.0f), -99, 98);

    char body[96];
    char sentence[112];
    snprintf(body, sizeof(body), "LK8EX1,999999,%d,%d,%d,0.0",
             altitudeMeters, verticalSpeedCms, temperatureC);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

static void sendOwnshipHeartbeat()
{
    if (settings == nullptr || ThisAircraft.addr == 0U) return;

    uint32_t txPackets = 0;
    uint32_t rxPackets = 0;
    RF_GetPacketCounters(txPackets, rxPackets);

    char body[96];
    char sentence[112];
    snprintf(body, sizeof(body), "PSRFH,%06lX,%u,%lu,%lu,0",
             (unsigned long)(ThisAircraft.addr & 0xFFFFFFUL),
             (unsigned)settings->rf_protocol,
             (unsigned long)rxPackets,
             (unsigned long)txPackets);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

static int exportSignalSource(uint8_t source)
{
    /*
     * Совместимость с форматом FlyRf24_08_30_01:
     *   0 - LoRa/FLARM
     *   1 - ADS-B/DUMP1090
     *   2 - текстовая строка GSM/Iridium
     *
     * Внутри текущего проекта TrafficSource использует другие значения
     * (1 = FLARM/LoRa, 2 = ADS-B). Для $FLYRF наружу возвращаем старую
     * кодировку, иначе сторонние UDP-приемники смещают/отбрасывают цель.
     */
    switch (source)
    {
        case TRAFFIC_SOURCE_FLARM_LORA: return 1;
        case TRAFFIC_SOURCE_ADSB_DUMP1090: return 2;
        default: return 0;
    }
}

static bool aircraftAltitudeLooksMissing(const Aircraft& ac)
{
    return ac.altitude <= 0.5f && ThisAircraft.altitude > 100.0f;
}

