MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_07_20_04/NMEA.cpp
static float exportAircraftAltitude(const Aircraft& ac)
{
    if (aircraftAltitudeLooksMissing(ac))
    {
        return ThisAircraft.altitude;
    }
    return ac.altitude;
}

static float exportAircraftPressureAltitude(const Aircraft& ac, float exportAltitude)
{
    if (ac.pressure_altitude < -100.0f || ac.pressure_altitude <= 0.5f)
    {
        return exportAltitude;
    }
    return ac.pressure_altitude;
}

// - body: Параметр геометрии, координаты, размера или угла.
static void sendAircraftFLYRF(const Aircraft& ac)
{
    if (settings == nullptr) return;
    if (!ac.valid || ac.addr == 0U || !aircraftHasCoordinates(ac)) return;

    char callsign[9] = {};
    memcpy(callsign, ac.callsign, 8);
    callsign[8] = '\0';

    const float exportAltitude = exportAircraftAltitude(ac);
    const float exportPressureAltitude = exportAircraftPressureAltitude(ac, exportAltitude);

    char body[256];
    char sentence[280];
    snprintf(body, sizeof(body),
             "FLYRF,%06lX,%d,%8.8s,%d,%d,%d,%d,%d,%.6f,%.6f,%d,%d,%d,%d,%u",
             (unsigned long)(ac.addr & 0xFFFFFFUL),
             ac.squawk,
             callsign,
             (int)lroundf(exportAltitude),
             (int)lroundf(exportPressureAltitude),
             (int)lroundf(ac.speed),
             (int)lroundf(ac.course),
             ac.vert_rate,
             (double)ac.latitude,
             (double)ac.longitude,
             (int)ac.aircraft_type,
             exportSignalSource(ac.signal_source),
             (int)ac.hour_msg,
             (int)ac.min_msg,
             (unsigned)ac.delay_time_msg);

    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

// - body: Параметр геометрии, координаты, размера или угла.
static void sendAircraftPFLAA(const Aircraft& ac, int& totalObjects, float& hpDistance, int& hpRelNorth, int& hpRelEast, int& hpAltDiff, uint32_t& hpAddr)
{
    if (settings == nullptr) return;
    if (!ac.valid || ac.addr == 0U) return;
    if (!aircraftHasCoordinates(ac)) return;
    if (ThisAircraft.local_latitude == 0.0f && ThisAircraft.local_longitude == 0.0f) return;

    const float exportAltitude = exportAircraftAltitude(ac);
    const int relNorth = (int)lroundf(ac.distance * cosf(ac.bearing * DEG_TO_RAD));
    const int relEast = (int)lroundf(ac.distance * sinf(ac.bearing * DEG_TO_RAD));
    const int relVertical = (int)lroundf(exportAltitude - ThisAircraft.altitude);
    const int alarmLevel = (ac.alarm_level >= 0) ? ac.alarm_level : 0;
    char callsign[16] = {};
    sanitizeCallsign(ac.callsign, callsign, sizeof(callsign));
    if (callsign[0] == '\0')
    {
        makeFallbackCallsign(ac, callsign, sizeof(callsign));
    }

    char climbRate[12] = {};
    snprintf(climbRate, sizeof(climbRate), "%.1f", ac.vert_rate / 196.8504f);

    char body[220];
    char sentence[244];
    snprintf(body, sizeof(body),
             "PFLAA,%d,%d,%d,%d,%u,%06lX!%s,%d,,%d,%s,%X",
             alarmLevel,
             relNorth,
             relEast,
             relVertical,
             (unsigned)min((uint8_t)3U, ac.addr_type),
             (unsigned long)(ac.addr & 0xFFFFFFUL),
             callsign,
             (int)lroundf(ac.course),
             (int)lroundf(ac.speed),
             climbRate,
             (unsigned)ac.aircraft_type);

    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    if (len > 0)
    {
        sendNmeaToConfiguredOutput(sentence, len);
        ++totalObjects;
        if (ac.distance < hpDistance)
        {
            hpDistance = ac.distance;
            hpRelNorth = relNorth;
            hpRelEast = relEast;
            hpAltDiff = relVertical;
            hpAddr = ac.addr & 0xFFFFFFUL;
        }
    }
}

// - body: Параметр геометрии, координаты, размера или угла.
static void sendPFLAU(int totalObjects, float hpDistance, int hpRelNorth, int hpRelEast, int hpAltDiff, uint32_t hpAddr)
{
    if (settings == nullptr) return;

    char body[160];
    char sentence[180];
    float ownLat = 0.0f;
    float ownLon = 0.0f;
    const int gnssStatus = getOwnshipPosition(ownLat, ownLon) ? 2 : 0;
    int relBearing = 0;
    if (hpDistance < 1.0e9f)
    {
        relBearing = (int)lroundf(atan2f((float)hpRelEast, (float)hpRelNorth) * 57.2957795f - ThisAircraft.course);
        while (relBearing < -180) relBearing += 360;
        while (relBearing > 180) relBearing -= 360;
        snprintf(body, sizeof(body),
                 "PFLAU,%d,1,%d,1,0,%d,2,%d,%d,%06lX",
                 totalObjects,
                 gnssStatus,
                 relBearing,
                 hpAltDiff,
                 (int)lroundf(hpDistance),
                 (unsigned long)hpAddr);
    }
    else
    {
        snprintf(body, sizeof(body),
                 "PFLAU,0,1,%d,1,0,,0,,,",
                 gnssStatus);
    }
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

// - line: Счетчик, индекс, позиция или номер элемента.
static void sendAircraftContainer(const Aircraft& ac)
{
    char line[180];  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    const int written = snprintf(line, sizeof(line),
                                 "ICAO=%06lX,SRC=%u,LAT=%.6f,LON=%.6f,ALT=%d,SPD=%.1f,CRS=%.1f,RSSI=%d,SNR=%.1f,AGE=%lu\r\n",
                                 (unsigned long)ac.icao,
                                 (unsigned)ac.source,
                                 ac.lat,
                                 ac.lon,
                                 (int)lroundf(ac.altitude),
                                 ac.speed,
                                 ac.course,
                                 ac.rssi,
                                 ac.snr,
                                 (unsigned long)(millis() - ac.lastUpdate));
    if (written > 0)
    {
        sendContainerToConfiguredOutputs(line, (size_t)written);
    }
}

